Revit 2027 API
FailureMessageAccessor.GetFailureDefinitionId Method
 Retrieves the Id of the FailureDefinition of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureDefinitionId GetFailureDefinitionId()
Public Function GetFailureDefinitionId As FailureDefinitionId
public:
FailureDefinitionId^ GetFailureDefinitionId()
member GetFailureDefinitionId : unit -> FailureDefinitionId
Return Value
FailureDefinitionId
 The Id of the FailureDefinition of the failure.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace